class AdvicesData {
  final List<Map<String, dynamic>> adviceData = [
    {
      'title': 'Планирование и бюджетирование',
      'content': ['Начните с тщательного планирования всех этапов ремонта.', 'Разрабатывайте бюджет и старайтесь придерживаться его, учитывая возможные неожиданные расходы.'],
    },
    {
      'title': 'Выбор материалов',
      'content': ['Приобретайте качественные материалы у проверенных поставщиков для долговечности.', 'Изучите характеристики материалов и выбирайте их согласно функциональности и стилю вашего дома.'],
    },
    {
      'title': 'Инструменты и оборудование',
      'content': ['Убедитесь, что у вас есть все необходимые инструменты перед началом работ.', 'Обратите особое внимание на безопасность при работе с инструментами.'],
    },
    {
      'title': 'Стена и потолок',
      'content': ['Перед покраской или обоями сделайте подготовку поверхности: шпаклевка, шлифовка, выравнивание.', 'Учтите возможные проблемы с проводкой и трубами в стенах.'],
    },
    {
      'title': 'Полы',
      'content': ['При выборе напольного покрытия учитывайте характеристики помещения (например, влажность для ванной комнаты).', 'Правильно подготовьте основание для укладки напольного покрытия.'],
    },
    {
      'title': 'Электрика и сантехника',
      'content': ['При необходимости обращайтесь к профессионалам для проведения электромонтажных и сантехнических работ.', 'Убедитесь в соответствии всех работ нормам и правилам безопасности.'],
    },
    {
      'title': 'Декорирование и дизайн',
      'content': ['Используйте цвета и текстиль, чтобы добавить уют и индивидуальность вашему дому.', 'Экспериментируйте с мебелью и аксессуарами, чтобы создать уникальный интерьер.'],
    },
    {
      'title': 'Уборка и поддержание',
      'content': ['После завершения ремонта осуществите генеральную уборку помещения.', 'Регулярно поддерживайте чистоту и порядок, чтобы сохранить свежий вид вашего дома.'],
    },
  ];
}
